# **7 - Validating**

## Importing Libraries

In [41]:
from sqlalchemy import create_engine
import pandas as pd

## Connect to Database

In [42]:
engine = create_engine('postgresql://bryguan:qwertyuiop@localhost:5432/acme')
connection = engine.connect().execution_options(auto_commit = True)

## Validating Data 2

### Customers 2: Sale ID in Sales 2: Sale ID

In [47]:
query = '''

SELECT
    sale_id
FROM
    customers_2
WHERE
    sale_id NOT IN (
        SELECT
            sale_id
        FROM
            sales_2
    );

'''

try:
    with connection.begin():
        display(pd.read_sql_query(query, connection))
except Exception as e:
    print(f' Error {e}')

Empty DataFrame
Columns: [sale_id]
Index: []

### Sales 2: Total = Sales 2: Subtotal + Tax

In [35]:
query = '''

SELECT
    sale_id
FROM
    sales_2
WHERE
    total <> (subtotal + tax);

'''

try:
    with connection.begin():
        display(pd.read_sql_query(query, connection))
except Exception as e:
    print(f' Error {e}')

Empty DataFrame
Columns: [sale_id]
Index: []

### Sales 2: Total = Line Items 2: Price * Quantity

In [36]:
query = '''

SELECT
    sale_id
FROM
    sales_2
WHERE
    sales_2.total <> (
        SELECT
            SUM(price * quantity)
        FROM
            line_items_2
        WHERE
            sales_2.sale_id = line_items_2.sale_id
    );

'''

try:
    with connection.begin():
        display(pd.read_sql_query(query, connection))
except Exception as e:
    print(f' Error {e}')

Empty DataFrame
Columns: [sale_id]
Index: []

### Stores 2: Sale ID in Sales 2: Sale ID

In [48]:
query = '''

SELECT
    sale_id
FROM
    stores_2
WHERE
    sale_id NOT IN (
        SELECT
            sale_id
        FROM
            sales_2
    );

'''

try:
    with connection.begin():
        display(pd.read_sql_query(query, connection))
except Exception as e:
    print(f' Error {e}')

Empty DataFrame
Columns: [sale_id]
Index: []

### Line Items 2: Sale ID in Sales 2: Sale ID

In [49]:
query = '''

SELECT
    sale_id
FROM
    line_items_2
WHERE
    sale_id NOT IN (
        SELECT
            sale_id
        FROM
            sales_2
    );

'''

try:
    with connection.begin():
        display(pd.read_sql_query(query, connection))
except Exception as e:
    print(f' Error {e}')

Empty DataFrame
Columns: [sale_id]
Index: []

### Line Items 2: Product ID in Product Mapping 2: Product ID

In [55]:
query = '''

SELECT
    product_id
FROM
    line_items_2
WHERE
    product_id NOT IN (
        SELECT
            product_id
        FROM
            product_mappings_2
    );

'''

try:
    with connection.begin():
        display(pd.read_sql_query(query, connection))
except Exception as e:
    print(f' Error {e}')

Empty DataFrame
Columns: [product_id]
Index: []

## Validating Data 2 IN Data 1

### Customers 2: City, State, ZIP Code in Zip Codes 1: City, State, ZIP Code

In [58]:
query = '''

SELECT
    city,state, zip_code
FROM
    customers_2
WHERE
    (city, state, zip_code) NOT IN (
        SELECT
            city, state, zip_code
        FROM
            zip_codes_1
    );

'''

try:
    with connection.begin():
        display(pd.read_sql_query(query, connection))
except Exception as e:
    print(f' Error {e}')

Empty DataFrame
Columns: [city, state, zip_code]
Index: []

### Customers 2: First Name, Last Name in Customers 1: First Name, Last Name

In [60]:
query = '''

SELECT
    first_name, last_name
FROM
    customers_2
WHERE
    (first_name, last_name) NOT IN (
        SELECT
            first_name, last_name
        FROM
            customers_1
    );

'''

try:
    with connection.begin():
        display(pd.read_sql_query(query, connection))
except Exception as e:
    print(f' Error {e}')

  first_name last_name
0      Hyrum  Knuckles
1       Hali    Ducker
2      Clyve   Humonds
3      Kalli     Kemel
4     Honina   Philson
5      Nicky     Haley
6          I  Odunniom
7    Clemens  McAloren
8       Eula    Dewair

### Sales 2: Date, Total in Sales 1: Date, Total

In [69]:
query = '''

SELECT
    date, total
FROM
    sales_2
WHERE
    (date, total) NOT IN (
        SELECT
            date, total
        FROM
            sales_1
    );

'''

try:
    with connection.begin():
        display(pd.read_sql_query(query, connection))
except Exception as e:
    print(f' Error {e}')

Empty DataFrame
Columns: [date, total]
Index: []

### Stores 2: City in Stores 1: City

In [63]:
query = '''

SELECT
    city
FROM
    stores_2
WHERE
    city NOT IN (
        SELECT
            city
        FROM
            stores_1
    );

'''

try:
    with connection.begin():
        display(pd.read_sql_query(query, connection))
except Exception as e:
    print(f' Error {e}')

Empty DataFrame
Columns: [city]
Index: []

### Product Mappings 2: Product ID 1 IN Product 1: Product ID

In [71]:
query = '''

SELECT
    product_id_1
FROM
    product_mappings_2
WHERE
    product_id_1 NOT IN (
        SELECT
            product_id
        FROM
            products_1
    );

'''

try:
    with connection.begin():
        display(pd.read_sql_query(query, connection))
except Exception as e:
    print(f' Error {e}')

Empty DataFrame
Columns: [product_id_1]
Index: []

## Close Connection

In [38]:
connection.close()
engine.dispose()